# WRITE  BY HuRe
# PLUGIN FOR HuRe 
# @UI_XB

from telethon import events
import random, re
from ..Config import Config

from HuRe.utils import admin_cmd

import asyncio
from HuRe import l313l
from random import choice

from ..core.managers import edit_or_reply
from ..sql_helper.globals import gvarstatus
from . import mention

plugin_category = "extra"

rehu = [
    "اللّهُم راحه مُستديمه,لا نِهاية لهـا💛🍁",
    "اللهِم  راحة بال وايّـام حلوة💛🍁",
    "اللَّهم صُب آياتِ القرآنِ في صُدورِنا صباً حتّى يُشفى بآثارِها كُل شعورٍ مُر 💛",
    "ويبقى صوت القرآن ، ماءً باردًا نقيًا ينحدر مِن السماء ليُطفئ حُزن قلبِك💛🍁",
    "اللهُـ۾ القـوّه عـند الضُـعـف💛🍁اللهُـ۾ القـوّه عـند الضُـعـف💛🍁ُ",
    "اللهُم اشغلني بذكِرك عن كُل ذكِر💛🍁",
    "اللهم انزع من قلبي حب كل شيء لا تحبه💝ِهِ",
    "‏اللهّم أجبُرني جبرًا يُعوضُ قلبي عن كُل شيءو",
    "- هذِهِ الدُّنيا سَراب بينَ آتٍ ومُودِّع ما خُلِقنَا الله للبقاء نَحنُ للّٰهِ سَنَرجِع .",
    "ماسكن القرآن قلباً إلا قوّاه ونقّاه وثبته .🤍ه",
    "من يترك كل شي في يدِ الله ، سيرى يد الله في كلّ شيءٍ..🤍🪐َّ",
    "من أخفى عن الناس همّه متوكلاً على الله، كفاه الله ما أهمّهُ وأرضاه ❤🌿.",
    "كانَ مهمومًا، ولكنّ قلبهُ يطمئنّ حين يصلّي على النبي ﷺ.🤍ٌ",
    "‏نحن مدينون بالحب لكل من جعلنا نبصر شيئًا جميلًا في أنفسنا حين أوشكنا على الإنطفاء",
    "- حُلمي وإن طالَ المدى سأنالهُ، ما دامَ لي فوقَ السَّماءِ معينُ💜.ه",
    "اللهم إنّا مقصرون وأنت الكريم، ومذنبون وأنت الحليم، وفقراء إليك وأنت الغني عنّا، اللهم تجاوز عنا بعفوك ومغفرتك. 《 ‏-آمين 》",
    "ما ضرك لو أطفأ هذا العالمُ أنوارهُ كلها في وجهك؛ ما دام نورُ اللهِ في قلبِكَ متوهّجًا؟🤍",
    "لعل الله في هذا اليوم يدبر لك شئياً يرضيك به ، شيئاً يجعلك تسجد فرحاً لحدوثه♥️🌿",
]
@l313l.ar_cmd(pattern="الاوامر(?:\s|$)([\s\S]*)")
async def _(event):
     if not event.text[0].isalpha() and event.text[0] not in ("/", "#", "@", "!"):
        UP_UO = random.choice(rehu)
        await event.edit(
        f": **⦑ 𝑯𝑬𝑳𝑳𝑶 {mention} 𝑰𝑵 𝒁𝑬 ⦒**\n۞———————﷽———————۞\n( `.م1` )  ⦙ **اوامر الادمن**\n( `.م2` )  ⦙ **اوامر المجموعة**\n( `.م3` )  ⦙ **اوامر الترحيب والردود**\n( `.م4` )  ⦙ **حماية خاص والتلكراف**\n( `.م5` )  ⦙ **اوامر المنشن والانتحال**\n( `.م6` )  ⦙ **اوامر التحميل والترجمة**\n( `.م7` )  ⦙ **اوامر المنع و القفل**\n( `.م8` )  ⦙ **اوامر التنظيف والتكرار**\n( `.م9` )  ⦙ **اوامر التخصيص والفارات**\n( `.م10` ) ⦙ **اوامر الوقتي و التشغيل**\n( `.م11` ) ⦙ **اوامر الكشف و الروابط**\n( `.م12` ) ⦙ **اوامر المساعدة والإذاعة** \n( `.م13` ) ⦙ **اوامر الارسال والاذكار**\n( `.م14` ) ⦙ **اوامر المـلصقات وكوكل**\n( `.م15` ) ⦙ **اوامر التسلية والميمز والتحشيش** \n( `.م16` ) ⦙ **اوامر الصيغ والجهات**\n( `.م17` ) ⦙ **اوامر التمبلر والزغرفة والمتحركة**\n( `.م18` ) ⦙ **اوامر الحساب والترفيه**\n( `.م19` ) ⦙ **اوامر الميوزك والتشغيل**\n( `.م20` ) ⦙ **اوامر بصمات الميمز**\n( `.م21` ) ⦙ **اوامر تجميع النقاط وبوت وعد**\n( `.م22` )  ⦙ **اوامر اضافيه**\n( `.م23` )  ⦙ **اوامر ZE**\n( `.م24` )  ⦙ **اوامر الميمز**\n( `.م25` )  ⦙ **اوامر الميمز²**\n( `.م26` )  ⦙ **اوامر العاب ZE**\n( `.م27` )  ⦙ **اوامر الهمسه**\n( `.م28` )  ⦙ **اوامر حالات الحساب**\n( `.م29` )  ⦙ **اوامر جديده**\n( `.م30` )  ⦙ **اوامر الاشتراك ألاجباري**\n( `.م31` )  ⦙ **اوامر التكرار و الاضافه**\n( `.م32` )  ⦙ **اوامر الجروب²**\n( `.م33` )  ⦙ **اوامر الڪشف و التمبلر**\n( `.م34` )  ⦙ **اوامر الرشق و جوجله**\n( `.م35` )  ⦙ **اوامر الذاتية**\n( `.م36` )  ⦙ **اوامر التحكم**\n( `.م37` )  ⦙ **اوامر الزخرفةو التجميع²**\n( `.م38` )  ⦙ **اوامر التمبلريه**\n( `.م39` )  ⦙ **اوامر التحميل و العرض**\n( `.م40` )  ⦙ **اوامر المساعده و التحويل**\n (`.م41` )  ⦙ **اوامر الصيد**\n(`.م42` )  ⦙ **اوامر التكبر و الفيزات**\n(`.م43` )  ⦙ **اوامر اسماء الحساب**\n۞———————﷽———————۞\n**⌯︙[┈┉━｢ 𝑺𝑶𝑼𝑹𝑪𝑬 𝒁𝑬 🔱 ｣━┅┈](t.me/UI_XB)**\n۞———————﷽———————۞\n **۞︙ {UP_UO} **"
)

@l313l.ar_cmd(
    pattern="م1$",
    command=("م1", plugin_category),
)
async def _(event):
	if not event.text[0].isalpha() and event.text[0] not in ("/", "#", "@", "!"):
		await event.edit(
		"** قائمة اوامر الادمن لسورس  زد إي **:\n ۞———————﷽———————۞\n ۞︙ اختر احدى هذه القوائم\n\n- ( `.اوامر الحظر` )\n- ( `.اوامر الكتم` )\n- ( `.اوامر التثبيت` )\n- ( `.اوامر الاشراف` )\n۞———————﷽———————۞\n⌔︙CH : @UI_XB"
)
		
@l313l.ar_cmd(
    pattern="م2$",
    command=("م2", plugin_category),
)
async def _(event):
	if not event.text[0].isalpha() and event.text[0] not in ("/", "#", "@", "!"):
		await event.edit(
		"** قائمة اوامر المجـموعه لسورس  زد إي **:\n ۞———————﷽———————۞\n ۞︙ اختر احدى هذه القوائم\n\n- ( `.اوامر التفليش` )\n- ( `.اوامر المحذوفين` )\n- ( `.اوامر الكروب` )\n۞———————﷽———————۞\n⌔︙CH : @UI_XB"
)

@l313l.ar_cmd(
    pattern="م3$",
    command=("م3", plugin_category),
)
async def _(event):
	if not event.text[0].isalpha() and event.text[0] not in ("/", "#", "@", "!"):
		await event.edit(
		"** قائمة اوامر الـترحيب والـردود **:\n ۞———————﷽———————۞\n ۞︙ اختر احدى هذه القوائم\n\n- ( `.اوامر الترحيب` )\n- ( `.اوامر الردود` )\n۞———————﷽———————۞\n⌔︙CH : @UI_XB"
)
@l313l.ar_cmd(
    pattern="م4$",
    command=("م4", plugin_category),
)
async def _(event):
	if not event.text[0].isalpha() and event.text[0] not in ("/", "#", "@", "!"):
		await event.edit(
		"** قائمة اوامر حـماية الخاص والتلكراف **:\n ۞———————﷽———————۞\n ۞︙ اختر احدى هذه القوائم\n\n- ( `.اوامر الحماية` )\n- ( `.اوامر التلكراف` ) \n۞———————﷽———————۞\n⌔︙CH : @UI_XB"
)
@l313l.ar_cmd(
    pattern="م5$",
    command=("م5", plugin_category),
)
async def _(event):
	if not event.text[0].isalpha() and event.text[0] not in ("/", "#", "@", "!"):
		await event.edit(
		"** قائمة اوامر الـمنشن والانتحال **:\n ۞———————﷽———————۞\n ۞︙ اختر احدى هذه القوائم\n\n- ( `.اوامر الانتحال` )\n- ( `.اوامر التقليد` )\n- ( `.اوامر المنشن` ) \n۞———————﷽———————۞\n⌔︙CH : @UI_XB"
)

@l313l.ar_cmd(
    pattern="م6$",
    command=("م6", plugin_category),
)
async def _(event):
	if not event.text[0].isalpha() and event.text[0] not in ("/", "#", "@", "!"):
		await event.edit(
		"** قائمة اوامر التحميل والترجمه **:\n ۞———————﷽———————۞\n ۞︙ اختر احدى هذه القوائم\n\n- ( `.اوامر النطق` )\n- ( `.اوامر التحميل` )\n- ( `.اوامر الترجمة` ) \n۞———————﷽———————۞\n⌔︙CH : @UI_XB"
)

@l313l.ar_cmd(
    pattern="م7$",
    command=("م7", plugin_category),
)
async def _(event):
	if not event.text[0].isalpha() and event.text[0] not in ("/", "#", "@", "!"):
		await event.edit(
		"** قائمة اوامر القفل والمنع **:\n۞———————﷽———————۞\n ۞︙ اختر احدى هذه القوائم\n\n- ( `.اوامر القفل` )\n- ( `.اوامر الفتح` )\n- ( `.اوامر المنع` ) \n۞———————﷽———————۞\n⌔︙CH : @UI_XB"
)

@l313l.ar_cmd(
    pattern="م8$",
    command=("م8", plugin_category),
)
async def _(event):
	if not event.text[0].isalpha() and event.text[0] not in ("/", "#", "@", "!"):
		await event.edit(
		"** قائمة اوامر التكرار والتنظيف **:\n۞———————﷽———————۞\n ۞︙ اختر احدى هذه القوائم\n\n- ( `.اوامر التكرار` )\n- ( `.اوامر السبام` )\n- ( `.اوامر التنظيف` ) \n- ( `.اوامر المسح` ) \n۞———————﷽———————۞\n⌔︙CH : @UI_XB"
)

@l313l.ar_cmd(
    pattern="م9$",
    command=("م9", plugin_category),
)
async def _(event):
	if not event.text[0].isalpha() and event.text[0] not in ("/", "#", "@", "!"):
		await event.edit(
		"** قائمة التخصيص والفارات **:\n ۞———————﷽———————۞\n ۞︙ اختر احدى هذه القوائم\n\n- ( `.اوامر التخصيص` )\n لتغير الصور والكلايش كل من الحماية والفحص والبنك\n- ( `.اوامر الفارات` )\n - لتغير الاسم وزخرفة الوقت والصورة الوقتية والمنطقة الزمنية ورمز الاسم والبايو الوقتي وغيرها\n۞———————﷽———————۞\n⌔︙CH : @UI_XB"
		)

@l313l.ar_cmd(
    pattern="م10$",
    command=("م10", plugin_category),
)
async def _(event):
	if not event.text[0].isalpha() and event.text[0] not in ("/", "#", "@", "!"):
		await event.edit(
		"** قائمة اوامر الوقتي والتشغيل **:\n ۞———————﷽———————۞\n ۞︙ اختر احدى هذه القوائم\n\n- ( `.اوامر الاسم` )\n- ( `.اوامر البايو` )\n- ( `.اوامر الكروب الوقتي` )\n- ( `.اوامر التشغيل` ) \n- ( `.اوامر الاطفاء` ) \n۞———————﷽———————۞\n⌔︙CH : @UI_XB"
)	

@l313l.ar_cmd(
    pattern="م11$",
    command=("م11", plugin_category),
)
async def _(event):
	if not event.text[0].isalpha() and event.text[0] not in ("/", "#", "@", "!"):
		await event.edit(
		"** قائمة اوامر الكـشف و الروابط **:\n ۞———————﷽———————۞\n ۞︙ اختر احدى هذه القوائم\n\n- ( `.اوامر الكشف` )\n- ( `.اوامر الروابط` ) \n\n ۞———————﷽———————۞\n⌔︙CH : @UI_XB"
)
@l313l.ar_cmd(
    pattern="م12$",
    command=("م12", plugin_category),
)
async def _(event):
	if not event.text[0].isalpha() and event.text[0] not in ("/", "#", "@", "!"):
		await event.edit(
		"** قائمة اوامر المساعدة  **:\n ۞———————﷽———————۞\n ۞︙ اختر احدى هذه القوائم\n\n- ( `.اوامر الوقت والتاريخ` )\n- ( `.اوامر كورونا` )\n- ( `.اوامر الصلاة` ) \n- ( `.اوامر مساعدة` )\n- ( `.اوامر الاذاعه` ) \n۞———————﷽———————۞\n⌔︙CH : @UI_XB"
)
@l313l.ar_cmd(
    pattern="م13$",
    command=("م13", plugin_category),
)
async def _(event):
	if not event.text[0].isalpha() and event.text[0] not in ("/", "#", "@", "!"):
		await event.edit(
		"** قائمة اوامر الارسال **:\n ۞———————﷽———————۞\n ۞︙ اختر احدى هذه القوائم\n\n- ( `.امر الصورة الذاتية` )\n- ( `.اوامر التحذيرات` )\n- ( `.اوامر اللستة` )\n- ( `.اوامر الملكية` ) \n- ( `.اوامر السليب` ) \n- ( `.اوامر الاذكار` )\n۞———————﷽———————۞\n⌔︙CH : @UI_XB"
)
@l313l.ar_cmd(
    pattern="م14$",
    command=("م14", plugin_category),
)
async def _(event):
	if not event.text[0].isalpha() and event.text[0] not in ("/", "#", "@", "!"):
		await event.edit(
		"** قائمة اوامر الملصقات وكوكل **:\n ۞———————﷽———————۞\n ۞︙ اختر احدى هذه القوائم\n\n- ( `.اوامر الملصقات` )\n- ( `.اوامر كوكل` )\n۞———————﷽———————۞\n⌔︙CH : @UI_XB"
)

@l313l.ar_cmd(
    pattern="م15$",
    command=("م15", plugin_category),
)
async def _(event):
	if not event.text[0].isalpha() and event.text[0] not in ("/", "#", "@", "!"):
		await event.edit(
		"** قائمة اوامر التسلية والتحشيش **:\n ۞———————﷽———————۞\n ۞︙ اختر احدى هذه القوائم\n\n- ( `.اوامر التسلية` )\n- ( `.اوامر التحشيش` )\n- ( `.اوامر الميمز` )\n۞———————﷽———————۞\n⌔︙CH : @UI_XB"
)

@l313l.ar_cmd(
    pattern="م16$",
    command=("م16", plugin_category),
)
async def _(event):
	if not event.text[0].isalpha() and event.text[0] not in ("/", "#", "@", "!"):
		await event.edit(
		"** قائمة اوامر تحويل الصيغ و الجهات **:\n ۞———————﷽———————۞\n ۞︙ اختر احدى هذه القوائم\n\n- ( `.اوامر التحويل` )\n- ( `.اوامر الجهات` ) \n۞———————﷽———————۞\n⌔︙CH : @UI_XB"
)

@l313l.ar_cmd(
    pattern="م18$",
    command=("م18", plugin_category),
)
async def _(event):
	if not event.text[0].isalpha() and event.text[0] not in ("/", "#", "@", "!"):
		await event.edit(
		"** قائمة اوامر الحساب و الترفيه **:\n ۞———————﷽———————۞\n ۞︙ اختر احدى هذه القوائم\n\n- ( `.اوامر الترفيه` )\n- ( `.اوامر الحساب` ) \n۞———————﷽———————۞\n⌔︙CH : @UI_XB"

)

@l313l.ar_cmd(
    pattern="م19",
    command=("م19", plugin_category),
)
async def _(event):
     if not event.text[0].isalpha() and event.text[0] not in ("/", "#", "@", "!"):
        await event.edit(
        " قائمة اوامر الميوزك والتشغيل 🎵\n ۞———————﷽———————۞\n۞︙ اختر احدى هذه الاوامر\n ۞︙ قبل أستخدام هذه الاوامر يجب تفعيل المود بكتابة ألامر ( `.ميوزك تفعيل` ) \n- ( `.تشغيل_المكالمة` )\n- لتشغيل المحادثة الصوتيه\n- ( `.انهاء_المكالمة` )\n-لأنهاء المحادثه الصوتية \n- ( `.دعوة` )\n- بالرد على الشخص لدعوته الى المكالمة \n- ( `.معلومات_المكالمة` )\n- لعرض عنوان المكالمة وعدد لاشخاص الموجودين فيها \n- ( `.تسمية_المكالمة` )\n- لتغير عنوان المكالمة \n- ( `.انضمام` )\n- للأنضمام الى المحادثة الصوتية\n- ( `.مغادرة` )\n- لمغادرة المحادثة الصوتية \n- ( `.تشغيل` )\n-بالرد على رابط اليوتيوب او كتابة الامر مع رابط ليوتيوب لتشغيل الاغنيه \n- ( `.قائمة_التشغيل` )\n- لعرض قائمة التشغيل \n- ( `.ايقاف_مؤقت` )\n - لأيقاف الاغنية الحالية مؤقتا \n- ( `.استمرار` )\n -لأستمرار الاغنيه التي تم ايقافها \n- ( `.تخطي` )\n- لتخطي الاغنيه وتشغيل الاغنيه الموجوده في قائمة التشغيل \n\n ۞———————﷽———————۞\n⌔︙CH : @UI_XB"



)

@l313l.ar_cmd(
    pattern="م20$",
    command=("م20", plugin_category),
)
async def _(event):
	if not event.text[0].isalpha() and event.text[0] not in ("/", "#", "@", "!"):
		await event.edit(
		"** قائمة اوامر بصمات الميمز **:\n ۞———————﷽———————۞\n ۞︙ اختر احدى هذه القوائم\n\n- ( `.بصمات ميمز` )\n- ( `.بصمات ميمز2` )\n- ( `.بصمات ميمز3` )\n- ( `.بصمات ميمز4` )\n- ( `.بصمات ميمز5` )\n- ( `.بصمات انمي` ) \n۞———————﷽———————۞\n⌔︙CH : @UI_XB"

)

@l313l.ar_cmd(
    pattern="م21$",
    command=("م21", plugin_category),
)
async def _(event):
    if not event.text[0].isalpha() and event.text[0] not in ("/", "#", "@", "!"):
        await event.edit(
            "** قائمة اوامر تجميع النقاط و بوت وعد **:\n ۞———————﷽———————۞\n ۞︙ اختر احدى هذه القوائم\n\n- ( `.اوامر التجميع` ) \n- ( `.اوامر وعد` ) \n۞———————﷽———————۞\n⌔︙CH : @UI_XB"

)

@l313l.ar_cmd(
    pattern="م22$",
    command=("م22", plugin_category),
)
async def _(event):
    if not event.text[0].isalpha() and event.text[0] not in ("/", "#", "@", "!"):
        await event.edit(
            "** اوامر اضافيه **:\n ۞———————﷽———————۞\n ۞︙ اختر احدى هذه الاوامر\n\n  1- .تجميع الجوكر\n 2- .تجميع العملاق\n 3- .تجميع الملوك\n 4- .تجميع العقاب\n 5- .سوره + اسم السوره\n 6- .اوامر الصيد\n 7- .فيزا\n 8- .ماستر\n 9- .تفعيل الترجمة التلقائية \n 10- .انطق + الرد علي النص\n 11- .استفتاء\n 12- .حساب العمر + السنه\n 13- .ايميل وهمي\n 14- .تغميق\n 15- .آيه نصيه\n۞———————﷽———————۞\n⌔︙CH : @UI_XB"
)

@l313l.ar_cmd(
    pattern="م23$",
    command=("م23", plugin_category),
)
async def _(event):
    if not event.text[0].isalpha() and event.text[0] not in ("/", "#", "@", "!"):
        await event.edit(
            "** اوامر ZE **:\n ۞———————﷽———————۞\n ۞︙ اختر احدى هذه الاوامر\n\n  1- .خط غامق\n 2- .خط رمز\n 3- .سوره للقارئ الشيخ + اسم الشيخ\n 4- .زد إي + السؤال\n 5- .ذك + السؤال\n 6- .رشق + رابط المنشور\n 7- .همسه\n۞———————﷽———————۞\n⌔︙CH : @UI_XB"

)

@l313l.ar_cmd(
    pattern="م24$",
    command=("م24", plugin_category),
)
async def _(event):
    if not event.text[0].isalpha() and event.text[0] not in ("/", "#", "@", "!"):
        await event.edit(
            "** اوامر الميمز **:\n ۞———————﷽———————۞\n ۞︙ اختر احدى هذه الاوامر\n\n  1- .اجمد كده\n 2- .يالهوي\n 3- .احترمي نفسك\n 4- .عيب\n 5- .مينفعش\n 6- .مديك قلبي\n 7- .اهلا بيك\n 8- .هعوره\n 9- .حفل\n 10- .خد نفس\n 11- .امال\n 12- .هتولعو\n 13- .انا تعبان\n 14- .عملت اي\n 15- .المخدرات\n۞———————﷽———————۞\n⌔︙CH : @UI_XB"
)

@l313l.ar_cmd(
    pattern="م25$",
    command=("م25", plugin_category),
)
async def _(event):
    if not event.text[0].isalpha() and event.text[0] not in ("/", "#", "@", "!"):
        await event.edit(
            "** اوامر الميمز² **:\n ۞———————﷽———————۞\n ۞︙ اختر احدى هذه الاوامر\n\n  1- .يا مرا\n 2- .بتحرجني\n 3- .انضف\n 4- .هنضحك\n 5- .يا راجل\n 6- .موزه\n 7- .انا فين\n 8- .خلصانه\n۞———————﷽———————۞\n⌔︙CH : @UI_XB"
)

@l313l.ar_cmd(
    pattern="م26$",
    command=("م26", plugin_category),
)
async def _(event):
    if not event.text[0].isalpha() and event.text[0] not in ("/", "#", "@", "!"):
        await event.edit(
            "** اوامر العاب ZE **:\n ۞———————﷽———————۞\n ۞︙ اختر احدى هذه الاوامر\n\n  1- .خيروك\n 2- .بوسة\n 3- .الالعاب\n 4- .كت\n 5- .شنو رأيك بهذا\n 6- .اذكار\n 7- .اذكار عشر\n۞———————﷽———————۞\n⌔︙CH : @UI_XB"
)

@l313l.ar_cmd(
    pattern="م28$",
    command=("م28", plugin_category),
)
async def _(event):
    if not event.text[0].isalpha() and event.text[0] not in ("/", "#", "@", "!"):
        await event.edit(
            "** اوامر حالات الحساب **:\n ۞———————﷽———————۞\n ۞︙ اختر احدى هذه الاوامر\n\n  1- .سليب + الرد علي الصوره \n 2- .اوفلاين\n 3- .اونلاين\n۞———————﷽———————۞\n⌔︙CH : @UI_XB"
)

@l313l.ar_cmd(
    pattern="م29$",
    command=("م29", plugin_category),
)
async def _(event):
    if not event.text[0].isalpha() and event.text[0] not in ("/", "#", "@", "!"):
        await event.edit(
            "** اوامر جديده **:\n ۞———————﷽———————۞\n ۞︙ اختر احدى هذه الاوامر\n\n  1- .للكل + الرساله\n 2- .للخاص + الرساله \n 3- .مصه\n 5- .الالعاب2\n۞———————﷽———————۞\n⌔︙CH : @UI_XB"


)

@l313l.ar_cmd(
    pattern="م30$",
    command=("م30", plugin_category),
)
async def _(event):
    if not event.text[0].isalpha() and event.text[0] not in ("/", "#", "@", "!"):
        await event.edit(
            "** اوامر الاشتراك ألاجباري **:\n ۞———————﷽———————۞\n ۞︙ اختر احدى هذه الاوامر\n\n  1- .ضع الاشتراك خاص\n 2- .ضع الاشتراك كروب\n 3- .تفعيل خاص\n 4- .تفعيل كروب\n 5- .تفعيل قروب\n 6- .تفعيل الكروب\n 7- .تعطيل خاص\n 8- .تعطيل كروب\n 9- .تعطيل قروب\n 10- .تعطيل الكروب\n 11- .تفعيل مجموعه\n 12- .تفعيل مجموعة\n 13- .تعطيل مجموعه\n 14- .تعطيل مجموعة\n۞———————﷽———————۞\n⌔︙CH : @UI_XB"

)

@l313l.ar_cmd(
    pattern="م31$",
    command=("م31", plugin_category),
)
async def _(event):
    if not event.text[0].isalpha() and event.text[0] not in ("/", "#", "@", "!"):
        await event.edit(
            "** اوامر الاضافه و التكرار **:\n ۞———————﷽———————۞\n ۞︙ اختر احدى هذه الاوامر\n\n  1- .ضيف + رابط الجروب \n 2- .اضف_جهاتي \n 3- .كرر + الرد علي النص \n 4- .تكرار الملصق + الرد علي الملصق \n 5- .سبام + الرد علي الحرف \n 6- .وسبام + الرد علي الكلمه \n 7- .نشر + الرد علي النص \n 8- .سوبر\n 9- .نشر_كروبات\n 10- .ايقاف التكرار\n 11- .ايقاف النشر\n 12- .النشر تعطيل\n 13- .النشر تفعيل\n۞———————﷽———————۞\n⌔︙CH : @UI_XB"
)

@l313l.ar_cmd(
    pattern="م32$",
    command=("م32", plugin_category),
)
async def _(event):
    if not event.text[0].isalpha() and event.text[0] not in ("/", "#", "@", "!"):
        await event.edit(
            "** اوامر الجروب² **:\n ۞———————﷽———————۞\n ۞︙ اختر احدى هذه الاوامر\n\n  1- .حذف المحظورين\n 2- .المحذوفين \n 3- .حظر_الكل\n 5- .كتم_الكل\n 6- .طرد_الكل\n 7- .الغاء التفليش\n 8- .مغادرة الكروبات\n 9- .مغادرة القنوات\n 10- .الذكاء تفعيل\n 11- .الذكاء تعطيل\n 12- .المميز تفعيل\n 13- .المميز تعطيل\n 14- .منع_التفليش\n 15- .سماح_التفليش\n۞———————﷽———————۞\n⌔︙CH : @UI_XB"

)
        
@l313l.ar_cmd(
    pattern="م33$",
    command=("م33", plugin_category),
)
async def _(event):
    if not event.text[0].isalpha() and event.text[0] not in ("/", "#", "@", "!"):
        await event.edit(
            "** اوامر الڪشف و التمبلر **:\n ۞———————﷽———————۞\n ۞︙ اختر احدى هذه الاوامر\n\n  1- .احمد\n 2- .انجليزية\n 3- .ايقاف انجليزية\n 4- .صورته + الرد علي الشخض\n 5- .اسمه + الرد علي الشخض\n 6- .اسمي\n 7- .ايديه + الرد علي الشخص\n 8- .رابطه + الرد علي الشخض\n 9- .زخرفة\n 10- .ايقاف الزخرفة\n۞———————﷽———————۞\n⌔︙CH : @UI_XB"

)

@l313l.ar_cmd(
    pattern="م34$",
    command=("م34", plugin_category),
)
async def _(event):
    if not event.text[0].isalpha() and event.text[0] not in ("/", "#", "@", "!"):
        await event.edit(
            "** اوامر الرشق و جوجل **:\n ۞———————﷽———————۞\n ۞︙ اختر احدى هذه الاوامر\n\n  1- .جوجل ar + الرد علي النص \n 2- .جوجل en + الرد علي النص \n 3- .رشق انستا + الرابط \n 4- .تيك توك + االرابط \n 5- .تفاعل + الرابط\n۞———————﷽———————۞\n⌔︙CH : @UI_XB"

 )
        
@l313l.ar_cmd(
    pattern="م37$",
    command=("م37", plugin_category),
)
async def _(event):
    if not event.text[0].isalpha() and event.text[0] not in ("/", "#", "@", "!"):
        await event.edit(
            "** اوامر الزخرفه و التجميع² **:\n ۞———————﷽———————۞\n ۞︙ اختر احدى هذه الاوامر\n\n  1- .تحميع دعمكم\n 2- .تجميع تناهيد \n 3- .تجميع سمسم\n 5- .تجميع المليون\n 6- .تجميع الجنرال\n 7- .اضف بوت تجميع بالرد علي معرف البوت\n 8- .زخرفه_انكليزي \n 9- .زخرفه_عربي \n 10- .الذكاء تفعيل\n 11- .الذكاء تعطيل\n 12- .المميز تفعيل\n 13- .المميز تعطيل\n 14- .منع_التفليش\n 15- .سماح_التفليش\n۞———————﷽———————۞\n⌔︙CH : @UI_XB"

)
        
@l313l.ar_cmd(
    pattern="م39$",
    command=("م39", plugin_category),
)
async def _(event):
    if not event.text[0].isalpha() and event.text[0] not in ("/", "#", "@", "!"):
        await event.edit(
            "** اوامر التحميل و العرض **:\n ۞———————﷽———————۞\n ۞︙ اختر احدى هذه الاوامر\n\n  1- .تقويم\n 2- .انستا + رابط الفيديو\n 3- .تيك توك1 + رابط الفيديو\n 4- .سجل الاسماء + الرد علي الشخض\n 5- .اسم الاغنيه + الرد علي المقطع\n 6- .بوتي\n 7- .نزعه + اليوزر\n 8- .فلم + اسم الفيلم\n 9- .النظام\n 10- .تجربة\n۞———————﷽———————۞\n⌔︙CH : @UI_XB"

)

@l313l.ar_cmd(
    pattern="م40$",
    command=("م40", plugin_category),
)
async def _(event):
    if not event.text[0].isalpha() and event.text[0] not in ("/", "#", "@", "!"):
        await event.edit(
            "** اوامر المساعده و التحويل **:\n ۞———————﷽———————۞\n ۞︙ اختر احدى هذه الاوامر\n\n  1- .بي دي اف + الرد علي الصوره \n 2- .تحذير + الرد علي الشخص \n 3- .نائم \n 4- .قيد + الرد علي الشخص \n 5- .احذف\n 6- .الانترنت\n 7- .تحويل ملكية\n 8- .معني + الاسم\n۞———————﷽———————۞\n⌔︙CH : @UI_XB"

)
        
@l313l.ar_cmd(
    pattern="م42$",
    command=("م42", plugin_category),
)
async def _(event):
    if not event.text[0].isalpha() and event.text[0] not in ("/", "#", "@", "!"):
        await event.edit(
            "** اوامر التكبر و الفيزات **:\n ۞———————﷽———————۞\n ۞︙ اختر احدى هذه الاوامر\n\n  1- .مود التكبر  + عدد الثواني \n 2- .مود التكبر تعطيل \n 3- .التكبر + عدد الثواني + ايدي الشخص \n 4- .التكبر تعطيل \n 5- .السورس\n 6- .الايدي\n 7- .كشف_ايدي + الايدي \n 8- .رابط الحساب + الرد علي الشخص\n 9- .ولد + البين \n10- .جيك + الفيزا \n11- .النعلومات + اختصار الدوله \n۞———————﷽———————۞\n⌔︙CH : @UI_XB"

)
        
@l313l.ar_cmd(
    pattern="م43$",
    command=("م43", plugin_category),
)
async def _(event):
    if not event.text[0].isalpha() and event.text[0] not in ("/", "#", "@", "!"):
        await event.edit(
            "** اوامر اسماء الحساب **:\n ۞———————﷽———————۞\n ۞︙ اختر احدى هذه الاوامر\n\n  1- .اسمي احمد \n #سيتوفر المزيد من الاسماء قريبا# \n۞———————﷽———————۞\n⌔︙CH : @UI_XB"



        )
        
